Tekla Open API Reference for Tekla Structures 2025
View.ViewShorteningAttributes.CutSkewParts Property
 Defines whether cut skewed parts are enabled (true) or disabled (false).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CutSkewParts { get; set; }
Public Property CutSkewParts As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
View.ViewShorteningAttributes Class
Tekla.Structures.Drawing Namespace